[
  {
    "Term": "AO (Authorizing Official)",
    "Definition": "An official with the authority to formally assume responsibility for operating an information system at an acceptable level of risk to agency operations (including mission, functions, image, or reputation), agency assets, or individuals.",
    "Reference": "NIST"
  },
  {
    "Term": "Architecture",
    "Definition": "An architecture contains descriptions of all the components of a selected, acceptable solution while allowing certain details of specific components to be variable to satisfy related constraints (e.g., costs, local environment, user acceptability).",
    "Reference": "NIST"
  },
  {
    "Term": "ATO (Authorization to Operate)",
    "Definition": "The official management decision given by a senior organizational official to authorize operation of an information system and to explicitly accept the risk to organizational operations.",
    "Reference": "NIST"
  },
  {
    "Term": "BRM (Business Reference Model)",
    "Definition": "It is a classification taxonomy used to describe the type of business functions and service types in a particular solution architecture at the system, segment, agency, sector, federal, national, or international level. The taxonomy identifies business function and subfunction areas as well as related services that are performed within and between federal agencies and with external partners. The BRM can help to identify opportunities for collaboration, shared services, and solution reuse in agency IT portfolios and inter-agency Lines of Business.",
    "Reference": "FEAF"
  },
  {
    "Term": "Business Service",
    "Definition": "A software component participating in a service-oriented architecture that provides functionality or participates in realizing one or more capabilities.  A set of related IT components provided in support of one or more business processes.",
    "Reference": "NIST"
  },
  {
    "Term": "Business System",
    "Definition": "A business system represents a logical boundary for related assets (e.g., software, devices, and people) to accomplish one or more business capabilities. A business system is accessed by the end user via a graphical user interface (e.g. web application, desktop application, etc.).",
    "Reference": "NIST"
  },
  {
    "Term": "Capability",
    "Definition": "A set of mutually reinforcing security controls implemented by technical, physical, and procedural means. Typically selected to achieve a common information security-related purpose.",
    "Reference": "NIST"
  },
  {
    "Term": "Cloud Computing",
    "Definition": "A model for enabling, on-demand network access to a shared pool of configurable computing resources (e.g., networks, servers, storage, applications, and services) that can be rapidly provisioned and released with minimal management effort or service provider interaction.",
    "Reference": "NIST"
  },
  {
    "Term": "Cloud Provider or Provider",
    "Definition": "An organization that provides cloud services.",
    "Reference": "NIST"
  },
  {
    "Term": "CUI (Controlled Unclassified Information)",
    "Definition": "A categorical designation that refers to unclassified information, but under law or policy, it still requires protection from unauthorized disclosure, special handling safeguards, or prescribed limits on exchange or dissemination.",
    "Reference": "NIST"
  },
  {
    "Term": "EA (Enterprise Architecture)",
    "Definition": "The description of an enterprise’s entire set of information systems: how they are configured, how they are integrated, how they interface to the external environment at the enterprise’s boundary, how they are operated to support the enterprise mission, and how they contribute to the enterprise’s overall security posture.",
    "Reference": "NIST"
  },
  {
    "Term": "FEAF/FEA (Federal Enterprise Architecture Framework/Federal Enterprise Architecture)",
    "Definition": "A business-based framework for governmentwide improvement, that is intended to facilitate efforts to transform the federal government to one that is results-oriented, and market-based.",
    "Reference": "NIST"
  },
  {
    "Term": "FIPS (Federal Information Processing Standards)",
    "Definition": "A standard for adoption and use by federal departments and agencies.  FIPS covers some information technology in order to achieve a common level of quality or some level of interoperability.",
    "Reference": "NIST"
  },
  {
    "Term": "FISMA",
    "Definition": "Federal Information Security Modernization Act. FISMA requires each federal agency to develop, document, and implement an agency-wide program to provide information security for the information and systems that support the operations and assets of the agency.",
    "Reference": "NIST"
  },
  {
    "Term": "FISMA System",
    "Definition": "A FISMA system, also known as a FISMA container, information system, and/or system boundary, represents a logical boundary for which common security controls and policies are applied to a grouping of related assets (e.g., networks, devices, and people) to accomplish some mission or business objective. It is informed by security artifacts, such as a system security and privacy plan (SSPP). The FISMA container should also be thought of as the authorization boundary for an information system for which security controls and Federal Information Processing Standards (FIPS) impact ratings apply.",
    "Reference": "CISA"
  },
  {
    "Term": "Framework",
    "Definition": "A layered structure indicating what kind of programs can or should be built and how they would interrelate. Some computer system frameworks also include actual programs, specify programming interfaces, or offer programming tools for using the frameworks. A framework may be for a set of functions within a system and how they interrelate; the layers of an operating system; the layers of an application subsystem; how communication should be standardized at some level of a network; and so forth. A framework is generally more comprehensive than a protocol and more prescriptive than a structure.",
    "Reference": "NIST"
  },
  {
    "Term": "Governance",
    "Definition": "Governance means a group of policies, decision-making procedures, and management processes that work together to enable the effective planning and oversight of activities and resources.",
    "Reference": "FEAF"
  },
  {
    "Term": "Hybrid Cloud",
    "Definition": "The cloud infrastructure is a composition of two or more distinct cloud infrastructures (private, community, or public) that remain unique entities, but are bound together by standardized or proprietary technology that enables data and application portability.",
    "Reference": "NIST"
  },
  {
    "Term": "IaaS (Infrastructure as a Service)",
    "Definition": "The capability provided to the consumer is to provision processing, storage, networks, and other fundamental computing resources where the consumer is able to deploy and run arbitrary software, which can include operating systems and applications. The consumer does not manage or control the underlying cloud infrastructure but has control over operating systems, storage, and deployed applications; and possibly limited control of select networking components (e.g., host firewalls).",
    "Reference": "NIST"
  },
  {
    "Term": "Information Technology Product",
    "Definition": "A system, component, application, etc., that is based upon technology which is used to electronically process, store, or transmit information.",
    "Reference": "NIST"
  },
  {
    "Term": "Investment",
    "Definition": "Information technology investment means an expenditure of information technology resources to address mission delivery and management support. This may include a project or projects for the development, modernization, enhancement, or maintenance of a single information technology asset or group of information technology assets with related functionality, and the subsequent operation of those assets in a production environment. These investments shall have a defined life cycle with start and end dates.",
    "Reference": "OMB Circular A-130"
  },
  {
    "Term": "ISSM (Information Systems Security Manager)",
    "Definition": "Individual responsible for the information assurance of a program, organization, system, or enclave.",
    "Reference": "NIST"
  },
  {
    "Term": "ISSO (Information Systems Security Officer)",
    "Definition": "Individual with assigned responsibility for maintaining the appropriate operational security posture for an information system or program.",
    "Reference": "NIST"
  },
  {
    "Term": "IT Standards",
    "Definition": "The IT Standards inventory is the official GSA repository of software products/versions. This inventory can be used to determine which software has been reviewed and approved, ensuring that users are only requesting and using software that has been approved by IT Security. The Chief Technology Office (CTO) is responsible for managing the process and ensuring IT Standards are reviewed for use within GSA.",
    "Reference": "GEAR Report"
  },
  {
    "Term": "Life Cycle Model",
    "Definition": "Framework of processes and activities concerned with the life cycle that may be organized into stages, which also acts as a common reference for communication and understanding.",
    "Reference": "NIST"
  },
  {
    "Term": "Model",
    "Definition": "A very detailed description or scaled representation of one component of a larger system that can be created, operated, and analyzed to predict actual operational characteristics of the final produced component.",
    "Reference": "NIST"
  },
  {
    "Term": "NIST",
    "Definition": "National Institute of Standards and Technology.",
    "Reference": "NIST"
  },
  {
    "Term": "PaaS (Platform-as-a-Service)",
    "Definition": "The capability provided to the consumer is to deploy onto the cloud infrastructure consumer-created or acquired applications created using programming languages, libraries, services, and tools supported by the provider. The consumer does not manage or control the underlying cloud infrastructure including network, servers, operating systems, or storage, but has control over the deployed applications and possibly configuration settings for the application-hosting environment.",
    "Reference": "NIST"
  },
  {
    "Term": "PII (Personally Identifiable Information)",
    "Definition": "Information which can be used to distinguish or trace the identity of an individual (e.g., name, social security number, biometric records, etc.) alone, or when combined with other personal or identifying information which is linked or linkable to a specific individual (e.g., date and place of birth, mother's maiden name, etc.).",
    "Reference": "NIST"
  },
  {
    "Term": "Platform",
    "Definition": "A computer or hardware device and/or associated operating system, or a virtual environment, on which software can be installed or run.",
    "Reference": "NIST"
  },
  {
    "Term": "Records Management",
    "Definition": "Records Management provides a rational basis for making decisions about recorded information, including what should be saved and what should be discarded. These decisions are necessary to support the legal, fiscal, administrative, and other needs of the Government owned contractor operated facilities, the federal government, the individual State governments, and the general public. ",
    "Reference": "National Archives"
  },
  {
    "Term": "Requirement",
    "Definition": "A statement of need that must be met by a particular architecture or work package.",
    "Reference": "NIST"
  },
  {
    "Term": "SaaS (Software as a Service)",
    "Definition": "The capability provided to the consumer is to use the provider’s applications running on a cloud infrastructure. The applications are accessible from various client devices through either a thin client interface, such as a web browser (e.g., web-based email), or a program interface. The consumer does not manage or control the underlying cloud infrastructure including network, servers, operating systems, storage, or even individual application capabilities, with the possible exception of limited user-specific application configuration settings.",
    "Reference": "NIST"
  },
  {
    "Term": "Service",
    "Definition": "A software component participating in a service-oriented architecture that provides functionality or participates in realizing one or more capabilities.",
    "Reference": "NIST"
  },
  {
    "Term": "Service Provider",
    "Definition": "A provider of basic services or value-added services for operation of a network ­ generally refers to public carriers and other commercial enterprises.",
    "Reference": "NIST"
  },
  {
    "Term": "Subsystem",
    "Definition": "A major subdivision or component of an information system consisting of information, information technology, and personnel that performs one or more specific functions",
    "Reference": "NIST"
  },
  {
    "Term": "System",
    "Definition": "Combination of interacting elements organized to achieve one or more stated purposes.  1: There are many types of systems. Examples include: general and special-purpose information systems; and communication systems; financial, and transaction systems. 2: The inteacting elements in the definition of system include hardware, software, data, humans, processes, facilites, materials, and naturally occurring physical entities. 3: Systems of systems is included in the definition of system.",
    "Reference": "NIST"
  },
  {
    "Term": "TIME",
    "Definition": "As the aging application and product portfolios need more attention than budgets allow, application leaders should work with business stakeholders to apply top-down analysis and TIME categorization to prioritize opportunities for portfolio improvement using business and technology fitness, risk and cost.\nTriage Your Application and Product Portfolio by Using the TIME Model.\nDefine an Initial Remediation Strategy for Each of the Four Application Categories: Tolerate, Invest, Migrate and Eliminate\nTolerate — Re-engineer\nInvest — Innovate, Evolve\nMigrate — Modernize\nEliminate — Replace, Consolidate\nEngage and Involve Business Stakeholders by Discussing the TIME Model, and Jointly Identify and Prioritize Improvement Opportunities\nSupport Continuous Improvement of the Application Portfolio by Assessing the Portfolio Regularly",
    "Reference": "Gartner"
  },
  {
    "Term": "Web-enabled",
    "Definition": "Are applications and services that are accessed through a web browser and function through an internal and/or external Internet-protocol based collaboration environment (e.g., Internet, local area network, wide area network, public cloud, private cloud, and hybrid cloud).",
    "Reference": "FEAF"
  },
  {
    "Term": "Website",
    "Definition": "The websites report represents GSA's inventory of public-facing websites (i.e. accessible to the general public and not behind any authentication or firewall). This report can be used to better understand how the public views and interacts with GSA's business services, offerings, and information. This data is imported from the Touchpoints websites inventory as well as from the Enterprise Digital Experience (EDX) team's ecxcli website scans.",
    "Reference": "GEAR Report"
  }
]